app/controllers/api/bookings_controller.rb

    def create
        @booking = current_user.bookings.new(booking_params)

        if @booking.save
---
INSERT INTO "bookings" ("start_date", "end_date", "user_id", "spot_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_date", "2021-05-24"], ["end_date", "2021-05-27"], ["user_id", 23], ["spot_id", 87], ["created_at", "2021-05-23 16:44:59.082968"], ["updated_at", "2021-05-23 16:44:59.082968"]]