app/controllers/api/reviews_controller.rb

    def index
        @reviews = Review.includes(:user).where(spot_id: params[:spot_id])
---
SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."spot_id" = $1  [["spot_id", 86]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 23], ["id", 24]]

    def create
        @review = current_user.reviews.new(review_params)

        if @review.save
---
INSERT INTO "reviews" ("title", "body", "recommended", "author_id", "spot_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"