app/controllers/api/spots_controller.rb

SELECT "spots".* FROM "spots"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."spot_id" IN ($1, $2)  [["spot_id", 1], ["spot_id", 2]]
---
    def index
        spots = bounds ? Spot.in_bounds(bounds) : Spot.all
        @spots = spots.includes(:reviews)

SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
---
    def show
        @spot = Spot.find(params[:id])