app/views/api/spots/show.json.jbuilder

    json.partial! '/api/spots/spot', spot: @spot
    json.reviewIds @spot.reviews.pluck(:id)
---
SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."spot_id" = $1  [["spot_id", 60]]


@spot.reviews.includes(:author).each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."spot_id" = $1  [["spot_id", 60]]